app/controllers/events_controller.rb

  def showjson
    @events = Event.all
---
SELECT "events".* FROM "events"

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("created_at", "description", "start", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 08 Jul 2012 23:23:38 UTC +00:00], ["description", "Sup"], ["start", Sun, 08 Jul 2012], ["title", "New Event"], ["updated_at", Sun, 08 Jul 2012 23:23:38 UTC +00:00]]