app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Wha What"], ["created_at", Thu, 14 Jun 2012 01:38:12 UTC +00:00], ["name", "What What"], ["title", "What What"], ["updated_at", Thu, 14 Jun 2012 01:38:12 UTC +00:00]]

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "content" = 'Wha What ', "updated_at" = '2012-06-21 05:20:45.573798' WHERE "posts"."id" = 1